Revit 2027 API
BuiltInFailures.ElectricalFailures.MismatchPoleBrakesSlotsNumbers Property
 The number of pole breakers may not be less than the number of occupied slots.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchPoleBrakesSlotsNumbers { get; }
Public Shared ReadOnly Property MismatchPoleBrakesSlotsNumbers As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchPoleBrakesSlotsNumbers {
	FailureDefinitionId^ get ();
}
static member MismatchPoleBrakesSlotsNumbers : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace